core_backend/artillery/createCustomer.yml
config:
  target: 'http://localhost:3000'  # Replace with your API URL
  phases:
    - duration: 10        # Test duration in seconds
      arrivalRate: 1      # Number of new virtual users per second
  variables:
    msisdnPrefix: "254"    # Kenya prefix
  processor: "../src/artillery/generateNames.js"  # Path to the custom function

scenarios:
  - name: "Customer Creation Test"
    flow:
      - function: "generateNames"  # Use the custom function to generate names
      - post:
          url: "/customers"
          json:
            msisdn: "{{ msisdnPrefix }}{{ $randomNumber(100000000, 999999999) }}"
            firstName: "{{ firstName }}"
            lastName: "{{ lastName }}"
            personalBalance: "{{ $randomNumber(0, 50000) }}"